package np.com.naxa.simpledynamicforms.model;

/**
 * Created by Bakhati on 4/7/2017.
 */

public class Constants {

    public static String [] QUESTIONS = {"१. तपाईंको उमेर कती होला?*",  "२. तपाईंको लिङ्ग के हो?*",  "३. तपाईंको धर्म के हो?*",  "४. तपाईंको जाति के हो?*", "५. कुन पार्टीको उमेवारलाई मतदान गर्नुहुन्छ?*","६. तपाईं आगामी स्थानीय निर्वाचनमा मतदान गर्ने योजना छ?*", "७. के तपाईंलाई देश सही दिशामा जाँदै छ लाग्छ?*", "८. तपाईं कुन पार्टीसँग आबद्ध हुनुहुन्छ?*","९. मतदान गर्दा तपाईंलाई के महत्वोपूर्ण छ?*","१०. तपाईंको बिचारमा नेपालको सबैभन्दा महत्वोपूर्ण समस्या के हो?*","११. तपाईं पार्टी को मुख्य नेता बीच एक बहस रुचाउनुहुन्छ?*","१२. तपाईं वर्तमान प्रधानमन्त्री प्रचन्डको कार्यकाल कसरी मूल्याङ्कन गर्नु हुन्छ?*","१३. बास स्थान*","१४. जन्म स्थान*","१५. तपाईं आफूलाई कुन मूलको ठान्नु हुन्छ?*"," १६. मासिक आय*"};

    public static String [] AGE = {"१८-२९", "३०-४४", "४५-५९", "६०+"};
    public static String [] SEX = {"पुरुष", "महिला"};
    public static String [] RELIGION = {"हिन्दु", "मुसलमान" , "बौद्ध", "क्रिश्चियन", "अन्य"};
    public static String [] CAST = {"बाहुन", "छेत्री" , "नेवार", "दलित", "अन्य जनजाति"};
    public static String [] VOTE_POLITICAL_PARTY = {"नेपाली कांग्रेस", "एमाले" ,"माओवादी", "राप्रपा" , "मधेसी जनधिकार फोरुम", "सद्भावना पार्टी", "अन्य"};
    public static String [] VOTE_IN_NEXT_ELECTION = {"अवस्य गर्छु", "सायद गर्छु","थाहा छैन", "सायद गर्दिन","अवस्य गर्दिन"};
    public static String [] COUNTRY_MOVEMENT = {"सही", "गलत","थाहा छैन"};
    public static String [] DURING_ElECTION = {"पार्टी", "उमेदवार"};
    public static String [] NEPAL_PROBLEM = {"स्वास्थ्य र कल्याण", "शिक्षा र विद्यालय","अर्थव्यवस्था र रोजगार", "यातायात र विकास","अपराध, हिंसा र लागूपदार्थको", "राजनीतिज्ञ र सरकार"
                                               ,"वातावरण र प्रदूषण","सामाजिक र सांस्कृतिक मुद्दाहरू","जीवनको गुणस्तर","अन्य" };
    public static String [] TALK_LEADER = {"चाहन्छु", "चाहन्न","थाहा छैन"};
    public static String [] EVALUATION = {"धेरै सन्तुष्ट", "सन्तुष्ट","अनिर्णीत","असन्तुष्ट","धेरै असन्तुष्ट"};
    public static String [] DISTRICT = {"जिल्ला छान्नुहोस","अछाम ","अर्घाखाँची ","ईलाम ","उदयपुर ","ओखलढुङ्गा ","कन्चनपुर ","कपिलवस्तु ","काठमाण्डौ ","काभ्रेपलान्चोक ","कालिकोट ",
            "कास्की ","कैलाली ","खोटाङ ","गुल्मी ","गोरखा ","चितवन ","जाजरकोट ","जुम्ला ","झापा ","डडेलधुरा ","डोटी ","डोल्पा ","तनहुँ ","ताप्लेजुङ ","तेह्रथुम ","दाङ ",
            "दार्चुला ","दैलेख ","दोलखा ","धनकुटा ","धनुषा ","धादीङ्ग ","नवलपरासी ","नुवाकोट ","पर्वत ","पर्सा ","पाँचथर ","पाल्पा ","प्युठान ","बझाङ्ग ","बर्दिया ","बाँके ",
            "बाग्लुङ ","बाजुरा ","बारा ","बैतडी ","भक्तपुर ","भोजपुर ","मकवानपुर ","मनाङ्ग ","महोत्तरी ","मुगु ","मुस्ताङ्ग ","मोरङ ","म्याग्दी ","रसुवा ","रामेछाप ","रुकुम ",
            "रुपन्देही ","रोल्पा ","रौतहट ","लम्जुङ्ग ","ललीतपुर ","सखुवासभा ","सप्तरी ","सर्लाही ","सल्यान ","सिन्धुपाल्चोक ","सिन्धुली ","सिराहा ","सुनसरी ","सुर्खेत ",
            "सोलुखुम्बु ","स्याङ्जा ","हुम्ला"};
    public static String [] BIRTHPLACE = {};
    public static String [] FRAG_ID = {};
    public static String [] ORIGINALITY = {"हिमालि ", "पहाडी","मधेशी"};
    public static String [] MONTHLY_INCOME = {"२० हजार", "२०-४० हजार","७०-१ लाख","१ लाख भन्दा बदी"};
}
